app/controllers/programs_controller.rb

  def index
    @programs = Program.all
---
SELECT "programs".* FROM "programs"

  def update
    respond_to do |format|
      if @program.update(program_params)
---
UPDATE "programs" SET "cover" = ?, "updated_at" = ? WHERE "programs"."id" = 894006417  [["cover", "http://fr.web.img1.acsta.net/r_160_240/b_1_d6d6d6/medias/nmedia/18/83/56/27/20158098.jpg"], ["updated_at", "2014-09-24 21:25:29.535687"]]

    def set_program
      @program = Program.find(params[:id])
---
SELECT  "programs".* FROM "programs"  WHERE "programs"."id" = ? LIMIT 1  [["id", 894006417]]