app/controllers/welcome_controller.rb

  def index
    @programs = Program.all
---
SELECT "programs".* FROM "programs"  WHERE 1=0